<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<%
	if(JSPUtils.logoutUser(request, response) || JSPUtils.requiresLogin(request, response)){
		return;
	}
%>
  <html dir="rtl">
    <head>
    <link rel="stylesheet" type="text/css" href="style.css" />
        <script src="functions.js"></script>
        <%@include file="header.jsp"%>
    </head>
    
  <body class="on_first">
    
    <table class="container">
      <tr>
        <td colspan="2">
          מה זה FIRST?
        </td>
      </tr>
      <tr>
        <td>
          FRC (First Robotics Competition) היא תחרות פיתוח טכנולוגי בינלאומית
          במסגרת ארגון FIRST שמיועדת לבני נוער בכיתות ט' עד יב'. <br />
          התחרות נוסדה על ידי דין קיימן ב-1992, ומאז 2005 ישראל שולחת קבוצות
          לתחרות.
          <br />
          קבוצות מורכבות מתלמידי בית ספר מסוים או אזור מסוים, ונודעות במספר
          (בהתאם למועד הרשמותם) ובשם.
        </td>
        <td><img src="img/FIRSTWordMark_Black.gif" /></td>
      </tr>
      <tr>
        <td colspan="2">
          על העונה
        </td>
      </tr>
      <tr>
        <td>
          בכל שנה ביום שבת הראשון של השבוע הראשון של חודש ינואר נחשף משחק שונה,
          <br />ועל הקבוצות לבנות רובוט שמסוגל לבצע את המשימות הנדרשות במהלך
          המשחק.
          <br />
          לכל קבוצה ניתן פרק זמן של 6 וחצי שבועות כדי לבנות את הרובוט ולהכין
          אותו לתחרות על פי חוקי התחרות. <br />
          <br />
          לכל קבוצה ניתנת ערכת כלים בסיסית, והיא מהווה את הבסיס לבנייתו של
          הרובוט.
          <br />
          על כל קבוצה להתחלק למספר תת-קבוצות, העוסקות כל אחת בפן אחר בבנייתו של
          הרובוט, תכנותו, בניית אתר אינטרנט לקבוצה, וכן הלאה. <br />
          על הרובוט, לבסוף, לבצע 3 משימות עיקריות, פעולה אוטונומית שנקבעת כחלק
          מהמשחק (ללא כל עזרת מגע אנושי) <br />
          כגון קליעת סלים, משחק ידני (בו מפעילים את הרובוט חברי הקבוצה) ויכולת
          ביצוע משימת מבטחים, <br />כגון עליה על רמפות והרמת רובוט אחר.
        </td>

        <td><img style="height: 230px !important;" src="img/grimlock.png"/></td>
      </tr>
      <tr>
        <td colspan="2">
          First בישראל
        </td>
      </tr>
      <tr>
        <td>
          ישראל משתתפת בתחרות הרובוטיקה מאז 2005. <br />
          בשנה הראשונה התחרות נערכה במרכז הקונגרסים בחיפה, <br />
          ובשנים לאחר מכן עד שנת 2016 היא נערכה באופן קבוע בהיכל מנורה מבטחים
          שבתל אביב. משנת 2017, <br />
          נערכים בארץ כ-5 אירועים במסגרת מעבר לשיטת תחרות שונה, שיטה אזורית,
          כאשר הגמר נערך בהיכל מנורה מבטחים שבתל אביב. <br />
          בכל שנה נערכים משחקי מוקדמות שמטרתם היא לשלוח את הקבוצות הטובות ביותר
          מהארץ לתחרות הבינלאומית ביוסטון, טקסס.
        </td>
        <td><img src="img/firstIsrael.png"/></td>
      </tr>
      <tr>
        <td colspan="2">
          Power Up
        </td>
      </tr>
      <tr>
        <td>
          FIRST POWER UP הוא משחק שהמטרה בו היא לנצח את משחק הארקייד. <br />
          כדי לנצח יש לצבור יותר נקודות מאשר ברית היריב, על די הטיית נדנדות לצד
          בצבע הברית באמצעות קוביות המפוזרות ברחבי המגרש. <br />
          בתחילת המשחק יש 15 שניות של פעולה אוטונומית של הרובוטים, בנוסף ל-2
          דקות ו-15 שניות של משחק בהם הרובוטים מופעלים על ידי נהגי הקבוצות.
          <br />
          ניתן להוציא את הקוביות אל עמדות השליטה ולקבל בונוסים במהלך המשחק.<br />
          בסוף המשחק יש לטפס על הנדנה המרכזית המוגבהת על מנת להתמודד עם ה"בוס".
          <br />
        </td>
        <td><img src="img/powerUp.png"/></td>
      </tr>
      <tr>
		<td colspan="2">
           מנצחים בשנת 2018
        </td>
      </tr>
      <tr>
        <td>
          בתחרות השתתפו 70 קבוצות, התחרות חולקה ל4 תחרויות קדם (דיסטריקטים)
          ותחרות גמר סופית בה השתתפו 45 קבוצות.<br />
          המנצחים בשנה זו היו 1577 Steampunk מרעננה, 1574 MisCar ממשגב ו-7079
          Co-Bot מחיפה. <br />
          בפרס הרוקי-אולסטאר זכתה קבוצה 7067 מירושלים <br />
          בפרס יושב הראש זכתה קבוצה 2096 רובואקטיב מדימונה <br />
          בפרס הEI זכו קבוצות 6168 ו3075
        </td>
        <td><img src="img/winners.png"/></td>
      </tr>
      <tr>
		<td colspan="2">
          הישגים ישראליים
        </td>
      </tr>
      <tr>
        <td>
          2015 -<br />
          3339 עלו לאיינשטיין <br />
          <br />
          2016 -<br />
          1690 הגיעו לגמר העולמית<br />
          3339 עלו לאיינשטיין<br />
          3211 זכו בEI עולמי<br />
          <br />
          2017 -<br />
          2630 ו5654 עלו לאיינשטיין<br />
          2096 זכו בEI עולמי<br />
          <br />
          2018 -<br />
          3075 אלופי עולם<br />
          1574 עלו לאיינשטיין<br />
          2096 פיינליסטים של פרס יושב הראש העולמי<br />
          5987 זכו בEI עולמי<br />
        </td>

        <td><img id="trophy" src="img/trophy.png"/></td>
      </tr>
    </table>
  </body>
</html>
